--- a/README.md
+++ b/README.md
@@ -197,62 +198,71 @@ classDiagram
 
 ### Container diagram
 
-```mermaid
-    C4Container
-      title Container diagram for Chat System
-      Person(user, "Chat User", "A user authenticated on chat system.")
-      Person(3rd, "3rd Party System", "Third party systems interacting through apis.")
+```plantuml
+@startuml
+!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Container.puml
 
-    Container_Boundary(chat, "Chat System") {
-        
-        Container_Ext(mobile_app, "Mobile App", "iOS/Android", "Mobile app used by users to interact on chat")
-        Container_Ext(web_app, "Web App", "Node,Javascript", "Web app used by users to interact on chat")
-        
-        Container(auth, "Authentication Service", "Service", "Service responsible for authenticating users")
+Person(user, "Chat User", "A user authenticated on chat system.")
+Person(3rd, "3rd Party System", "Third party systems interacting through apis.")
 
-        Container(lb, "Load Balancer", "Nginx", "Balance load to chat api cluster")
-        ContainerDb(file_storage, "File storage service", "File storage service", "Service to store uploaded files")
-        Container(backend_api, "Backend API", "Java, Docker container", "Provides chat functionality via api")
-        Container(notification_service, "Notification Service", "Java, Docker container/Serverless Function", "Service responsible for sending push notifications")
-        ContainerDb(db, "Chat DB", "NOSQL Database", "Chat system main database")
-        ContainerDb(notification_db, "Notification DB", "NOSQL Database", "Database to support dealing with notifications")
-        Container_Ext(fcm_apns, "FCM & APNS", "FCM & APNS", "Mobile platforms notification services")
-    }
+Container_Boundary(chat, "Chat System") {
+     Container_Ext(mobile_app, "Mobile App", "iOS/Android", "Mobile app used by users to interact on chat")
+     Container_Ext(web_app, "Web App", "Node,Javascript", "Web app used by users to interact on chat")   
+     Container(api_gateway, "API Gateway", "Java, Docker container", "3rd party gateway service") 
+     ContainerDb(file_storage, "File storage service", "File storage service", "Service to store uploaded files")
 
-    Rel(user, mobile_app, "Uses")
-    Rel(user, web_app, "Uses")
-    Rel(web_app, lb, "Uses")
-    Rel(mobile_app, lb, "Uses")
-    Rel(web_app, auth, "Uses")
-    Rel(mobile_app, auth, "Uses")
+     Container_Boundary(chat_service, "Chat Service") {
+         Container(backend_api, "Backend API", "Java, Docker container", "Provides chat functionality via api")
+         ContainerDb(db, "Chat DB", "NOSQL Database", "Chat system main database")
+     }
 
-    Rel(3rd, lb, "Uses")
-    Rel(lb, backend_api, "Balances load to")
-    Rel(backend_api, db, "Reads from and writes to")
-    Rel(notification_service, fcm_apns, "Reads from and writes to")
-    Rel(notification_service, notification_db, "Sends notifications to")
-    Rel(backend_api, notification_service, "Uses")
-    Rel(mobile_app, file_storage, "Uploads to")
-    Rel(web_app, file_storage, "Uploads to")
-    Rel(backend_api, file_storage, "Load uploaded files from")
+     Container_Boundary(notification, "Notification Service") {
+         Container(notification_service, "Notification Service", "Java, Docker container/Serverless Function", "Service responsible for sending push notifications")
+         ContainerDb(notification_db, "Notification DB", "NOSQL Database", "Database to support dealing with notifications")
+     }
+}
 
-    UpdateLayoutConfig($c4BoundaryInRow="2")
+Container_Ext(auth, "Authentication Service", "Service", "Service responsible for authenticating users")
+Container_Ext(fcm_apns, "FCM & APNS", "FCM & APNS", "Mobile platforms notification services")
+
+Rel(user, mobile_app, "Uses")
+Rel(user, web_app, "Uses")
+Rel(3rd, api_gateway, "Uses")
+
+Rel(mobile_app, file_storage, "Uploads to")
+Rel(web_app, file_storage, "Uploads to")
+Rel(backend_api, db, "Reads from and writes to")
+Rel(api_gateway, backend_api, "Calls")
+Rel(web_app, backend_api, "Calls")
+Rel(mobile_app, backend_api, "Calls")
+Rel_L(backend_api, file_storage, "Load uploaded files from")
+Rel(notification_service, notification_db, "Reads from and writes to")
+Rel(notification_service, fcm_apns, "Saves notifications to")
+
+Rel_L(mobile_app, auth, "Authenticates on")
+Rel_L(web_app, auth, "Authenticates on")
+Rel_L(api_gateway, auth, "Authenticates on")
+Rel_L(backend_api, auth, "Validades authentication")
+Rel(backend_api, notification_service, "Uses")
+
+@enduml
 ```
 
 ### Component diagram
 
